src_ext/Documents/УЗ_НачислениеУченику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_НачислениеУченику</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/AccumulationRegisters/УЗ_СписанияСуммЗаУроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УЗ_СписанияСуммЗаУроки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЯвок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Явка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокамС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещатьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Documents/УЗ_НачислениеУченику/Ext/ObjectModule.bsl
//Начисление ученику (решение владельца В15, 28.09.2026): набор, материалы, взнос — «прочее начисление» покупателю,
//как в типовых. Уменьшает остаток денег ученика (регистр УЗ_СписанияСуммЗаУроки, Расход) по предмету в организации
//документа — так же, как проведённый урок «К оплате»: аванс ученика уменьшается, без аванса появляется долг.
//Деньги кассы не меняет (оплата — приход денег «Касса ученики»); % педагога — от оплаты ученика, начисление его
//не меняет. Педагог, группа, тариф, абонемент не заполняются: начисление — не урок.
Процедура ОбработкаПроведения(Отказ, Режим)

	//дата запрета проверяется подпиской УЗ_ДатаЗапретаПередЗаписью (модуль УЗ_ДатыЗапрета)

	//обязательное — и при программной записи (проверку заполнения платформа зовёт только из формы)
	Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
		СообщитьОбОшибке(НСтр("ru = 'Укажите ученика.'"), "ФизЛицо", Отказ);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СтатьяЗатрат) Тогда
		СообщитьОбОшибке(НСтр("ru = 'Укажите статью: за что начислено (набор, материалы, взнос).'"), "СтатьяЗатрат", Отказ);
	КонецЕсли;
	Если Сумма <= 0 Тогда
		СообщитьОбОшибке(НСтр("ru = 'Укажите сумму начисления больше нуля.'"), "Сумма", Отказ);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Движения.УЗ_СписанияСуммЗаУроки.Записывать = Истина;
	Движение = Движения.УЗ_СписанияСуммЗаУроки.Добавить();
	Движение.ВидДвижения     = ВидДвиженияНакопления.Расход;
	Движение.Период          = Дата;
	Движение.Клиент          = ФизЛицо;
	Движение.ПредметОбучения = ПредметОбучения;
	Движение.Организация     = Организация;
	Движение.Сумма           = Сумма;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	//ученик, статья и сумма — обязательные реквизиты (FillChecking); сумма — больше нуля: начисление на 0 ничего
	//не начисляет, а отрицательное было бы скрытым приходом денег ученику мимо кассы
	Если Сумма <= 0 Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("Сумма");
		Если Индекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
		СообщитьОбОшибке(НСтр("ru = 'Укажите сумму начисления больше нуля.'"), "Сумма", Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = РегистрыСведений.УЗ_Настройки.Настройки().Организация;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.УЗ_ФизЛица") И ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		ФизЛицо = ДанныеЗаполнения;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(АвторДокумента) Тогда
		АвторДокумента = УЗ_Среда.ТекущийПользователь();
	КонецЕсли;
	//созданный программно (обработки, внешнее соединение) без организации — организация по умолчанию, как у ПКО
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = РегистрыСведений.УЗ_Настройки.Настройки().Организация;
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	АвторДокумента = Неопределено;
	Комментарий    = Неопределено;
КонецПроцедуры

Процедура СообщитьОбОшибке(Текст, Поле, Отказ)

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Поле = Поле;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();
	Отказ = Истина;

КонецПроцедуры
